import death01 from '../assets/การตาย 01.png';
import death02 from '../assets/การตาย 02.png';
import death03 from '../assets/การตาย 03.png';
import victim01 from '/เหยือ1.webp';
import victim02 from '/เหยือ2.webp';
import victim03 from '/เหยือ3.webp';

export const CORPSES_DATA = [
    {
        id: 0,
        direction: "NORTH (อุดร)",
        pos: { top: '15%', left: '50%' },
        element: "EARTH",
        cryptoType: "SYMMETRIC ENCRYPTION",
        iconName: "landslide",
        difficulty: "Easy",
        description: "ไฟล์ผลชันสูตรถูกเข้ารหัส XOR. จงหากุญแจที่เมื่อคำนวณแล้ว จะคืนค่าออกมาเป็น 'ชื่อทิศ' ที่พบศพรายนี้",
        challengeData: {
            ciphertext: "09 1D 1D 01 06 6A",
            hint: "ไฟล์ผลชันสูตรถูกเข้ารหัส XOR. จงหา KEY ที่เมื่อคำนวณแล้ว จะคืนค่าออกมาเป็น 'ชื่อทิศ.' ที่พบศพรายนี้",
            solution: "GROUND"
        },
        autopsyFindings: [
            "สภาพศพ: ถูกฝังดินลึกระดับไหล่ เหลือเพียงศีรษะโผล่พ้นดิน มีสัญลักษณ์รูปสามเหลี่ยมหัวคว่ำมีขีดกลางจารึกที่หน้าผาก",
            "ภายนอก: พบรอยช้ำเป็นวงรอบข้อมือทั้งสองข้าง ลักษณะถูกมัดไพล่หลังอย่างแน่นหนา",
            "ภายใน: ตรวจพบเศษดินโคลนจำนวนมากอัดแน่นในหลอดลมและปอด",
            "สาเหตุการตาย: ขาดอากาศหายใจจากการสำลักดิน (suffocation)",
            "สิ่งที่พบ: กระดาษที่มีกลอนเเปลกๆ เขียนไว้",
            "เวลาที่เสียชีวิต: ประมาณสามนาฬิกาหลังเที่ยงคืน"
        ],
        poem: `ทิศอุดร ป้อนธรณี พลีธาตุดิน 
          ฝังกายสิ้น ลงลึก ผนึกหมาย 
          เหลือเพียงเศียร พ้นพื้น ยืนท้าทาย 
          ดูดชีพวาย ใต้หล้า กลับมาเป็น`,
        calendarImg: death01 // ผูกรูปที่ 1
        ,
        victimImg: victim03 // รูปเหยือ 03
    },
    {
        id: 1,
        direction: "EAST (บูรพา)",
        pos: { top: '50%', left: '85%' },
        element: "WATER",
        cryptoType: "ASYMMETRIC (RSA)",
        iconName: "water_drop",
        difficulty: "Medium",
        description: "ถอดรหัส RSA เพื่อเข้าถึงผลตรวจสารพิษ. (ให้ p = Promethium, q = Iodine, e = 17)",
        challengeData: {
            ciphertext: "ถอดรหัส RSA เพื่อเข้าถึงผลตรวจสารพิษ จาก d ≡ e^(-1) (mod φ(n)) \nโดย φ(n) = (p-1)(q-1)",
            hint: "ให้ p = Nitrogen , q = Aluminium , e = Bromine )",
            solution: "33"
        },
        autopsyFindings: [
            "สภาพศพ: ลอยคว่ำหน้าในแหล่งน้ำ สภาพขึ้นอืด มีสัญสักษณ์รูปสามเหลี่ยมหัวลงตรงกลางหน้าผาก",
            "ภายนอก: ไม่พบรอยบาดแผลฉกรรจ์ แต่พบรอยเข็มฉีดยา บริเวณต้นคอด้านขวา",
            "พิษวิทยา: ตรวจพบสารพิษ ในกระแสเลือดปริมาณสูง",
            "สิ่งที่พบ: กระดาษที่มีกลอนเเปลกๆ เขียนไว้",
            "สรุป: ผู้ตายเป็นอัมพาตจากสารพิษและจมน้ำเสียชีวิตในเวลาต่อมา",
            "เวลาที่เสียชีวิต: ประมาณสามนาฬิกาหลังเที่ยงคืน"
        ],
        poem: "บูรพา บูชาชล ดลธาตุน้ำ \nปล่อยศพลอย ทวนลำ ที่เชี่ยวเข็ญ \nให้กระแส แทรกซึม ดื่มความเย็น \nชะล้างเข็ญ เลือดหมุน อุ่นกายา",
        calendarImg: death02 // ผูกรูปที่ 2
        ,
        victimImg: victim02 // รูปเหยือ 02
    },
    {
        id: 2,
        direction: "SOUTH (ทักษิณ)",
        pos: { top: '85%', left: '50%' },
        element: "WIND",
        cryptoType: "HASH FUNCTION",
        iconName: "air",
        difficulty: "Medium",
        description: "วิเคราะห์ความสัมพันธ์ของ 'รอบการตาย' จากปฏิทินที่ผ่านมา",
        challengeData: {
            // เปลี่ยนเป็นบอกให้ผู้เล่น 'คำนวณวันที่ในปฏิทินเท่านั้น'
            ciphertext: "วิเคราะห์ความสัมพันธ์จากปฏิทินที่ผ่านมา",
            hint: "'ธุลีคูณวารีผสานรวมระยะห่างรอบมรณา'",
            solution: "67"
        },
        autopsyFindings: [
            "สภาพศพ: แขวนคออยู่บนต้นไม้สูงด้วยเชือกไนลอน มีสัญลักษณ์รูปสามเหลี่ยมหัวขึ้นมีขีดตรงกลางจารึกตรงกลางหน้าผาก",
            "ภายนอก: พบฟกช้ำรอบลำคอจากการถูกเชือกไนลอนรัดแน่น",
            "สิ่งที่พบ : กระดาษที่มีกลอนเเปลกๆ เขียนไว้",
            "ข้อสังเกต: ภายในกระเป๋าผู้ตายพบกระดาษที่มีข้อความเเปลกๆอีกใบ",
            "สรุป: ผู้ตายถูกแขวนคอจนขาดอากาศหายใจเสียชีวิต เเละ สถานที่ก่อเหตุครั้งต่อไปน่าจะเป็นทิศตะวันตก",
            "เวลาที่เสียชีวิต: ประมาณสามนาฬิกาหลังเที่ยงคืน"
        ],
        poem: "ทิศทักษิณ ถิ่นวาโย โชว์ธาตุลม \nแขวนศพสม ยอดไม้ ไหว้เวหา \nให้ลมพัด ยัดเยียด เบียดวิญญา \nคืนลมปราณ สู่ปุระ อุระตน" +
            "ปัจจิม ริมอัคคี พลีธาตุไฟ \nเผาร่างให้ เกรียมกรม สมเหตุผล \nกระตุ้นเนื้อ ที่มอดไหม้ ให้ร้อนรน \nปลุกชีพคน ให้ฟื้น ตื่นนิทราฯ",
        calendarImg: death03 // ผูกรูปที่ 3
        ,
         victimImg: victim01 // รูปเหยือ 01
    },
    {
        id: 3,
        direction: "WEST (ปัจจิม)",
        pos: { top: '50%', left: '15%' },
        element: "FIRE",
        cryptoType: "SHIFT CIPHER",
        iconName: "local_fire_department",
        difficulty: "Hard",
        description: "ถอดรหัส Chip (Shift) Cipher ของกระดาษฉบับนี้",
        challengeData: {

            ciphertext:
                "ถอดรหัสข้อความเเปลกๆ D PDQ VWDONLQJ PH ของกระดาษฉบับนี้",
            hint:
                "Chip Cipher" +
                " ลองเลื่อนตัวอักษรไปข้างหน้าหรือข้างหลัง" +
                "ต้องเว้น SPACE ด้วยนะ",
            solution: "A MAN STALKING ME",
        },
        autopsyFindings: [
            "ข้อความที่ถูกถอดรหัส : A MAN STALKING ME",
            "สรุป: คาดว่าผู้ตายได้บอกใบ้ก่อนตายว่าคนร้ายเป็นผู้ชาย",
        ],
        poem: "\n\nD PDQ",
  
    }
];