import death01 from '../assets/การตาย 01.png';
import death02 from '../assets/การตาย 02.png';
import death03 from '../assets/การตาย 03.png';

export const CORPSES_DATA = [
  {
    id: 0,
    direction: "NORTH (อุดร)",
    pos: { top: '15%', left: '50%' },
    element: "EARTH",
    cryptoType: "SYMMETRIC ENCRYPTION",
    iconName: "landslide",
    difficulty: "Easy",
    description: "ไฟล์ผลชันสูตรถูกเข้ารหัส XOR. จงหากุญแจที่เมื่อคำนวณแล้ว จะคืนค่าออกมาเป็น 'ชื่อทิศ' ที่พบศพรายนี้",
    challengeData: {
      ciphertext: "09 1D 1D 01 06",
      hint: "ไฟล์ผลชันสูตรถูกเข้ารหัส XOR. จงหากุญแจที่เมื่อคำนวณแล้ว จะคืนค่าออกมาเป็น 'ชื่อทิศ' ที่พบศพรายนี้ \n Answer XXXXX(+D)",
      solution: "GROUND"
    },
    autopsyFindings: [
      "สภาพศพ: ถูกฝังดินลึกระดับไหล่ เหลือเพียงศีรษะโผล่พ้นดิน มีสัญลักษณ์รูปสามเหลี่ยมหัวคว่ำมีขีดกลางจารึกที่หน้าผาก",
      "ภายนอก: พบรอยช้ำเป็นวงรอบข้อมือทั้งสองข้าง ลักษณะถูกมัดไพล่หลังอย่างแน่นหนา",
      "ภายใน: ตรวจพบเศษดินโคลนจำนวนมากอัดแน่นในหลอดลมและปอด",
      "สาเหตุการตาย: ขาดอากาศหายใจจากการสำลักดิน (suffocation)",
      "เวลาที่เสียชีวิต: ประมาณสามนาฬิกาหลังเที่ยงคืน"
    ],
    poem: `ทิศอุดร ป้อนธรณี พลีธาตุดิน 
          ฝังกายสิ้น ลงลึก ผนึกหมาย 
          เหลือเพียงเศียร พ้นพื้น ยืนท้าทาย 
          ดูดชีพวาย ใต้หล้า กลับมาเป็น`,
    calendarImg: death01 // ผูกรูปที่ 1
  },
  {
    id: 1,
    direction: "EAST (บูรพา)",
    pos: { top: '50%', left: '85%' },
    element: "WATER",
    cryptoType: "ASYMMETRIC (RSA)",
    iconName: "water_drop",
    difficulty: "Medium",
    description: "ถอดรหัส RSA เพื่อเข้าถึงผลตรวจสารพิษ. (Given: n = 3233, e = 17. Find d)",
    challengeData: {
      ciphertext: "RSA Key Exchange Intercepted.",
      hint: "คำนวน d จาก d ≡ e^(-1) (mod φ(n)) \nโดย φ(n) = (p-1)(q-1) \nกำหนดให้ p = 61, q = 53 และ n = 3233",
      solution: "2753"
    },
    autopsyFindings: [
      "สภาพศพ: ลอยคว่ำหน้าในแหล่งน้ำ สภาพขึ้นอืด มีสัญสักษณ์รูปสามเหลี่ยมหัวลงตรงกลางหน้าผาก",
      "ภายนอก: ไม่พบรอยบาดแผลฉกรรจ์ แต่พบรอยเข็มฉีดยา บริเวณต้นคอด้านขวา",
      "พิษวิทยา: ตรวจพบสาร Arsenic (สารหนู) ในกระแสเลือดปริมาณสูง",
      "สรุป: ผู้ตายเป็นอัมพาตจากสารพิษและจมน้ำเสียชีวิตในเวลาต่อมา",
      "เวลาที่เสียชีวิต: ประมาณสามนาฬิกาหลังเที่ยงคืน"
    ],
    poem: "บูรพา บูชาชล ดลธาตุน้ำ \nปล่อยศพลอย ทวนลำ ที่เชี่ยวเข็ญ \nให้กระแส แทรกซึม ดื่มความเย็น \nชะล้างเข็ญ เลือดหมุน อุ่นกายา",
    calendarImg: death02 // ผูกรูปที่ 2
  },
  {
    id: 2,
    direction: "SOUTH (ทักษิณ)",
    pos: { top: '85%', left: '50%' },
    element: "WIND",
    cryptoType: "HASH FUNCTION",
    iconName: "air",
    difficulty: "Medium",
    description: "วิเคราะห์ความสัมพันธ์ของ 'รอบการตาย' จากปฏิทินที่ผ่านมา",
    challengeData: {
      // เปลี่ยนเป็นบอกให้ผู้เล่น 'คำนวณวันที่ในปฏิทินเท่านั้น'
      ciphertext: "EVIDENCE_KEY: คำนวณวันที่ ใน ปฎิทิน",
      ciphertextDisplay: "EVIDENCE_KEY: คำนวณวันที่ ใน ปฎิทิน",
      hint: "พิจารณาปฏิทิน: 'ผลคูณของสองวันที่ ผสานรวมกับระยะห่างของรอบมรณา'",
      solution: "67"
    },
    autopsyFindings: [
      "สภาพศพ: แขวนคออยู่บนกิ่งไม้สูงด้วยเชือกไนลอน มีสัญลักษณ์รูปสามเหลี่ยมหัวขึ้นมีขีดตรงกลางจารึกตรงกลางหน้าผาก",
      "ภายนอก: ลายนิ้วมือถูกทำลายด้วยสารเคมีกัดกร่อนรุนแรง",
      "ข้อสังเกต: รอยเชือกที่คอมีลักษณะกดทับในแนวเฉียงขึ้น แต่พบรอยกดทับอื่นที่เกิดขึ้นหลังตาย",
      "สรุป: สารเคมีที่พบคือ กรดเข้มข้น (Acid)",
      "เวลาที่เสียชีวิต: ประมาณสามนาฬิกาหลังเที่ยงคืน"
    ],
    poem: "ทิศทักษิณ ถิ่นวาโย โชว์ธาตุลม \nแขวนศพสม ยอดไม้ ไหว้เวหา \nให้ลมพัด ยัดเยียด เบียดวิญญา \nคืนลมปราณ สู่ปุระ อุระตน",
    calendarImg: death03 // ผูกรูปที่ 3
  },
  {
    id: 3,
    direction: "WEST (ปัจจิม)",
    pos: { top: '50%', left: '15%' },
    element: "FIRE",
    cryptoType: "DIGITAL SIGNATURE",
    iconName: "local_fire_department",
    difficulty: "Hard",
    description: "ตรวจสอบ Digital Signature ของรายงานฉบับนี้",
    challengeData: {
      ciphertext: "Signer: Unknown\nHash Mismatch Detected.",
      hint: "เมื่อค่า Hash ไม่ตรงกัน การยืนยันตัวตน (Verification) ย่อมล้มเหลว... จงระบุศัพท์เทคนิคที่ใช้เรียก 'สถานะ' ของ Signature นี้",
      solution: "INVALID"
    },
    autopsyFindings: [
      "ข้อมูลการสืบสวน(การคาดการณ์): เป้าหมายรายต่อไปถูกกำหนดให้เป็นเหยื่อในพิธี 'บูชาอัคคี' (ธาตุไฟ)",
    ],
    poem: "ปัจจิม ริมอัคคี พลีธาตุไฟ \nเผาร่างให้ เกรียมกรม สมเหตุผล \nกระตุ้นเนื้อ ที่มอดไหม้ ให้ร้อนรน \nปลุกชีพคน ให้ฟื้น ตื่นนิทราฯ",
    calendarImg: null // รายที่ 4 ไม่มีรูป
  }
];